# Outcome Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TessellatedShapeBuilderResult..::..Outcome Property
TessellatedShapeBuilderResult Class See Also
---
What kinds of geometrical objects were built.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public TessellatedShapeBuilderOutcome Outcome { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Outcome As TessellatedShapeBuilderOutcome
	Get
```

Visual C++
---
```text
public:
property TessellatedShapeBuilderOutcome Outcome {
	TessellatedShapeBuilderOutcome get ();
}
```

# See Also
TessellatedShapeBuilderResult Class
Autodesk.Revit.DB Namespace